# IsSinglePoint Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..IsSinglePoint Method
AnalyticalModel Class See Also
---
Indicates if the Analytical Model can be expressed as a single point.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsSinglePoint()
```

Visual Basic
---
```text
Public Function IsSinglePoint As Boolean
```

Visual C++
---
```text
public:
bool IsSinglePoint()
```

# ### Return Value
True if Analytical Model can be expressed as a single point, false otherwise.
# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace